## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/909ed134-7a00-4081-aaf2-ce6d4ca7b309/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks"
        name                                = "dev-velidaaks"
        tags                                = {
            "environment" = "dev"
            "owner"       = "willvelida"
        }
        # (36 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.dapr-extension.azurerm_kubernetes_cluster_extension.ext will be created
  + resource "azurerm_kubernetes_cluster_extension" "ext" {
      + aks_assigned_identity = (known after apply)
      + cluster_id            = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks"
      + current_version       = (known after apply)
      + extension_type        = "Microsoft.Dapr"
      + id                    = (known after apply)
      + name                  = "dapr"
      + release_namespace     = (known after apply)
      + release_train         = "Stable"
      + target_namespace      = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place%0A  ~ resource "azurerm_kubernetes_cluster" "aks" {%0A        id                                  = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks"%0A        name                                = "dev-velidaaks"%0A        tags                                = {%0A            "environment" = "dev"%0A            "owner"       = "willvelida"%0A        }%0A        # (36 unchanged attributes hidden)%0A%0A      ~ default_node_pool {%0A            name                          = "default"%0A            tags                          = {}%0A            # (33 unchanged attributes hidden)%0A%0A          - upgrade_settings {%0A              - drain_timeout_in_minutes      = 0 -> null%0A              - max_surge                     = "10%25" -> null%0A              - node_soak_duration_in_minutes = 0 -> null%0A            }%0A        }%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # module.dapr-extension.azurerm_kubernetes_cluster_extension.ext will be created%0A  + resource "azurerm_kubernetes_cluster_extension" "ext" {%0A      + aks_assigned_identity = (known after apply)%0A      + cluster_id            = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks"%0A      + current_version       = (known after apply)%0A      + extension_type        = "Microsoft.Dapr"%0A      + id                    = (known after apply)%0A      + name                  = "dapr"%0A      + release_namespace     = (known after apply)%0A      + release_train         = "Stable"%0A      + target_namespace      = (known after apply)%0A    }%0A%0APlan: 1 to add, 1 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>